data = [
    {"日期": "2022-01-12", "最高气温": 15, "最低气温": 8, "天气": "晴", "风向": "东北风"},
    {"日期": "2022-02-12", "最高气温": 12, "最低气温": 7, "天气": "晴", "风向": "东北风"},
    {"日期": "2022-02-15", "最高气温": 11, "最低气温": 8, "天气": "多云", "风向": "西南风"},
    {"日期": "2022-03-09", "最高气温": 15, "最低气温": 13, "天气": "晴", "风向": "西北风"},
    {"日期": "2022-03-13", "最高气温": 19, "最低气温": 15, "天气": "小雨", "风向": "北风"},
    {"日期": "2022-06-18", "最高气温": 28, "最低气温": 22, "天气": "小雨", "风向": "西南风"},
]

import pandas as pd

df = pd.DataFrame(data)
print(df)
df.set_index("日期", inplace=True)
print(df)

df1 = pd.pivot_table(df, values=["最高气温", "最低气温"], index=["天气"])
print(df1)

df2 = pd.pivot_table(df, values=["最高气温", "最低气温"], index=["天气"], columns=["风向"])
print(df2)